# 🚀 Пет-проект уровня 2 — Визуализатор ссылок и памяти

> 🎯 **Цель:** написать программу, которая **показывает, что происходит в памяти**:
> сколько объектов, какие имена на что ссылаются, изменяемые они или нет. Сделав это,
> ты закрепишь модель «имена → объекты» намертво.

---

## 📋 Что должна уметь программа

Интерактивный инструмент-«рентген памяти»:

```
==== ВИЗУАЛИЗАТОР ПАМЯТИ ====
> create a [1, 2, 3]
a → объект id=140234 тип=list изменяемый, refcount=1

> alias b a
b → тот же объект id=140234 (теперь refcount=2)
   a is b: True

> mutate b append 99
Объект id=140234 изменён на месте: [1, 2, 3, 99]
⚠️ a тоже видит изменение: [1, 2, 3, 99]

> copy c a
c → НОВЫЙ объект id=140555 (deep copy), a is c: False

> info
Имён: 3 (a, b, c) → 2 объекта в памяти
```

---

## ✅ Требования (минимум)

- [ ] Команды: создать переменную, сделать алиас, скопировать, изменить, показать инфо.
- [ ] Для каждого объекта показывать: `id`, `type`, изменяемость, число ссылок.
- [ ] Демонстрировать алиасинг: после изменения через один ярлык показывать, что другой
      ярлык «видит» то же.
- [ ] Различать shallow и deep копирование.
- [ ] Хранить переменные в словаре `{имя: объект}`.

---

## 🪜 Пошаговый план

1. **Хранилище.** Словарь `variables = {}` — имя→объект.
2. **create.** Команда создаёт объект из введённого литерала (можно через `eval` для
   учебного проекта, или парси простые случаи).
3. **info об объекте.** Функция, печатающая `id()`, `type().__name__`, изменяемость
   (проверь тип), `sys.getrefcount()`.
4. **alias.** `b = variables[a]` — покажи, что `id` совпадает.
5. **copy.** Используй `copy.deepcopy`, покажи новый `id`.
6. **mutate.** Примени метод (`append`, и т.п.) к объекту, покажи, какие имена ссылаются
   на этот объект (через сравнение `id`) → продемонстрируй алиасинг.
7. **Меню/цикл** чтения команд.

---

## 🧱 Скелет

```python
import sys
import copy

variables = {}

IMMUTABLE = (int, float, str, tuple, bool, frozenset, type(None))

def describe(name, obj):
    kind = "неизменяемый" if isinstance(obj, IMMUTABLE) else "изменяемый"
    print(f"{name} → id={id(obj)} тип={type(obj).__name__} {kind} "
          f"refcount≈{sys.getrefcount(obj) - 1}")

def names_pointing_to(obj):
    return [n for n, o in variables.items() if o is obj]

def cmd_create(name, literal):
    obj = eval(literal)          # учебно: разбираем литерал
    variables[name] = obj
    describe(name, obj)

def cmd_alias(new, src):
    variables[new] = variables[src]
    print(f"{new} ← тот же объект, что {src}")
    print(f"{src} is {new}:", variables[src] is variables[new])

def cmd_copy(new, src):
    variables[new] = copy.deepcopy(variables[src])
    print(f"{new} ← НОВЫЙ объект (deepcopy)")
    print(f"{src} is {new}:", variables[src] is variables[new])

# реализуй cmd_mutate, cmd_info, цикл команд сам!

print("Команды: create <имя> <литерал> | alias <new> <src> | copy <new> <src> | info | exit")
while True:
    parts = input("> ").split(maxsplit=2)
    if not parts:
        continue
    if parts[0] == "exit":
        break
    elif parts[0] == "create":
        cmd_create(parts[1], parts[2])
    elif parts[0] == "alias":
        cmd_alias(parts[1], parts[2])
    elif parts[0] == "copy":
        cmd_copy(parts[1], parts[2])
    # ...дополни остальные
```

> 💡 `eval` здесь допустим для учебного проекта (ты сам вводишь данные). В реальных
> программах `eval` опасен — об этом узнаешь в Уровне 4 (безопасность).

---

## 💪 Усложнения (для «отлично»)

- ➕ Подсчёт «сколько имён ссылается на каждый объект» и вывод карты «объект → [имена]».
- ➕ Сравнение shallow vs deep на вложенных структурах с наглядной демонстрацией бага.
- ➕ Команда `size <имя>` — показать `sys.getsizeof`.
- ➕ Команда `same <a> <b>` — показать `is` и `==` рядом с объяснением.
- ➕ Визуализация в виде ASCII-стрелок «имя → объект».

---

## 🏆 Критерии готовности

| Уровень | Что сделано |
|---------|-------------|
| ✅ Зачёт | Создание/алиас/копия/изменение + info с id/type/изменяемостью |
| 🌟 Хорошо | + демонстрация алиасинга и shallow/deep |
| 🏆 Отлично | + карта «объект→имена», size, наглядные стрелки |

---

## 🎓 Чему ты научился

Ты построил инструмент, который делает невидимое видимым — модель памяти Python теперь у
тебя «в пальцах». Это понимание — то, что отличает уверенного разработчика от того, кто
«копирует код со Stack Overflow и не понимает, почему список вдруг изменился».

Сохрани в `my-code/Python/02-memviz/`. 🎉

➡️ Дальше — [Уровень 3 · Middle](../03-middle/14-dict-set-hashing.md)
