# 17 · STL-алгоритмы, итераторы, лямбды

> 🎯 **Цель блока:** научиться обрабатывать контейнеры готовыми алгоритмами вместо ручных
> циклов, и освоить лямбды — анонимные функции.

---

## 📖 Итераторы — связь контейнеров и алгоритмов

**Итератор** — это «указатель на элемент» контейнера. Алгоритмы работают через них.

```cpp
std::vector<int> v = {10, 20, 30};

auto it = v.begin();         // итератор на первый элемент
std::cout << *it << "\n";    // 10 — разыменование
++it;                        // следующий
std::cout << *it << "\n";    // 20

// v.begin() — первый, v.end() — ПОСЛЕ последнего
for (auto it = v.begin(); it != v.end(); ++it)
    std::cout << *it << " ";
```

🖼️
```
   v: [10][20][30]
       ▲           ▲
    begin()      end() (за последним элементом)
```

💡 Обычно ты используешь range-based for (`for (x : v)`), а итераторы — под капотом. Но
алгоритмы STL принимают итераторы напрямую.

---

## ⭐ Лямбды — анонимные функции

Лямбда — функция «на месте», без имени. Незаменима для алгоритмов:

```cpp
auto square = [](int x) { return x * x; };
std::cout << square(5) << "\n";    // 25

// с захватом переменных из окружения [ ]
int factor = 3;
auto multiply = [factor](int x) { return x * factor; };  // захват по значению
std::cout << multiply(5) << "\n";  // 15
```

🖼️ Анатомия лямбды:
```
   [factor](int x) { return x * factor; }
    │       │        └─ тело
    │       └─ параметры
    └─ захват: какие внешние переменные видны внутри
```

| Захват | Значение |
|--------|----------|
| `[]` | ничего не захватывать |
| `[x]` | `x` по значению (копия) |
| `[&x]` | `x` по ссылке (можно менять) |
| `[=]` | всё по значению |
| `[&]` | всё по ссылке |

> 💡 Лямбда — это «функция + захваченное окружение» (замыкание), прямой аналог замыканий
> из [Python-курса](../../Python/04-senior/21-decorators-closures.md).

---

## ⭐ Алгоритмы STL — вместо ручных циклов

`#include <algorithm>` даёт десятки готовых алгоритмов. Они короче, понятнее и часто
быстрее ручных циклов.

```cpp
#include <algorithm>
#include <numeric>
std::vector<int> v = {5, 2, 8, 1, 9, 3};

// сортировка
std::sort(v.begin(), v.end());                    // по возрастанию
std::sort(v.begin(), v.end(), std::greater<>());  // по убыванию

// поиск
auto it = std::find(v.begin(), v.end(), 8);       // найти 8
bool has = std::binary_search(v.begin(), v.end(), 5);  // (на отсортированном)

// сумма
int sum = std::accumulate(v.begin(), v.end(), 0); // сумма всех

// подсчёт по условию (с лямбдой!)
int evens = std::count_if(v.begin(), v.end(), [](int x){ return x % 2 == 0; });

// преобразование каждого элемента
std::transform(v.begin(), v.end(), v.begin(), [](int x){ return x * 2; });

// min/max
auto mx = *std::max_element(v.begin(), v.end());
```

| Алгоритм | Что делает |
|----------|-----------|
| `std::sort` | сортировка |
| `std::find` | найти элемент |
| `std::count_if` | посчитать по условию |
| `std::accumulate` | сумма/свёртка |
| `std::transform` | применить функцию к каждому (как `map` в Python) |
| `std::copy_if` | отфильтровать (как `filter`) |
| `std::max_element` | максимум |
| `std::any_of` / `all_of` | проверить условие |

---

## ⭐ Пример: алгоритмы + лямбды вместе

```cpp
std::vector<int> v = {5, 2, 8, 1, 9, 3, 6};

// отсортировать по убыванию
std::sort(v.begin(), v.end(), [](int a, int b){ return a > b; });

// сумма чётных
int sumEven = 0;
std::for_each(v.begin(), v.end(), [&sumEven](int x){
    if (x % 2 == 0) sumEven += x;
});

// есть ли число больше 8?
bool big = std::any_of(v.begin(), v.end(), [](int x){ return x > 8; });
```

💡 STL-алгоритмы выражают **намерение** («отсортировать», «посчитать») вместо
механики цикла. Код становится чище и часто быстрее. Это питоничный по духу стиль в C++.

---

## ✅ Задачи

1. **sort.** Отсортируй вектор по возрастанию и убыванию.
2. **accumulate.** Посчитай сумму и произведение элементов.
3. **count_if.** Сколько чисел больше среднего?
4. **transform.** Возведи каждый элемент в квадрат.
5. **copy_if.** Отфильтруй чётные в новый вектор.
6. **Лямбда с захватом.** Посчитай, сколько элементов больше заданного порога (порог —
   захваченная переменная).
7. **Сортировка структур.** Создай `vector<Person>`, отсортируй по возрасту и по имени
   через лямбды.
8. ⭐ **min/max/avg** одной свёрткой, найди медиану через сортировку.

---

## ❓ Проверь себя

1. Что такое итератор? Что такое `begin()` и `end()`?
2. Что такое лямбда? Что значит «захват»?
3. Чем `[x]` отличается от `[&x]`?
4. Почему алгоритмы STL лучше ручных циклов?
5. Что делают `sort`, `accumulate`, `transform`, `count_if`?
6. Как связаны лямбды и замыкания из Python?

---

## ✅ Чек-лист

- [ ] Понимаю итераторы и begin/end
- [ ] Пишу лямбды с разными захватами
- [ ] Использую алгоритмы STL вместо ручных циклов
- [ ] Комбинирую алгоритмы с лямбдами
- [ ] Сортирую по своим критериям

➡️ Следующий: [18 · Перегрузка операторов](18-operator-overloading.md)
